database/seeders/CategoryTableSeeder.php

    public function run()
    {
        DB::table('categories')->insert([
            [
                'name'=>'Мобильные телефоны',
                'code'=>'mobile',
                'description'=>'В этом разделе вы найдёте самые популярные мобильные телефонамы по отличным ценам!',
                'image'=>'category/mobile.jpg',
            ],[
                'name'=>'Портативная техника',
                'code'=>'portable',
                'description'=>'Раздел с портативной техникой.',
                'image'=>'category/portable.jpg',
            ],[
                'name'=>'Бытовая техника',
                'code'=>'technicks',
                'description'=>'Раздел с бытовой техникой',
                'image'=>'category/technicks.jpg',
            ],
        ]);
---
insert into `categories` (`code`, `description`, `image`, `name`) values ('mobile', 'В этом разделе вы найдёте самые популярные мобильные телефонамы по отличным ценам!', 'category/mobile.jpg', 'Мобильные телефоны'), ('portable', 'Раздел с портативной техникой.', 'category/portable.jpg', 'Портативная техника'), ('technicks', 'Раздел с бытовой техникой', 'category/technicks.jpg', 'Бытовая техника')