database/seeders/OrderTableSeeder.php

insert into `orders` (`created_at`, `name`, `phone`, `status`, `user_id`) values ('2021-02-16 14:10:25', 'Юра', '89501850053', 1, '3'), ('2021-02-16 14:10:25', 'Юра', '89501850053', 1, '3'), ('2021-02-16 14:10:25', 'Юра', '89501850053', 1, '3')
---
    public function run()
    {
        DB::table('orders')->insert([
            [
                'status'  => 1,
                'name'    => 'Юра',
                'phone'   => '89501850053',
                'user_id' => '3',
                'created_at' => '2021-02-16 14:10:25'
            ],[
                'status'  => 1,
                'name'    => 'Юра',
                'phone'   => '89501850053',
                'user_id' => '3',
                'created_at' => '2021-02-16 14:10:25'
            ],[
                'status'  => 1,
                'name'    => 'Юра',
                'phone'   => '89501850053',
                'user_id' => '3',
                'created_at' => '2021-02-16 14:10:25'
            ],
        ]);