database/seeders/OrderProductTableSeeder.php

insert into `order_product` (`count`, `created_at`, `order_id`, `product_id`) values (1, '2021-02-16 14:10:25', 1, 1)
---
    public function run()
    {
        DB::table('order_product')->insert([
            [
                'order_id'   => 1,
                'product_id' => 1,
                'count'      => 1,
                'created_at' => '2021-02-16 14:10:25'
            ],
        ]);