database/seeders/UserTableSeeder.php

    public function run()
    {
        DB::table('users')->insert([
            [
                'name'     => 'admin',
                'email'    => 'admin@mail.ru',
                'password' => bcrypt('admin@mail.ru'),
                'is_admin' => 1,
            ],
            [
                'name'     => 'user',
                'email'    => 'user@mail.ru',
                'password' => bcrypt('user@mail.ru'),
                'is_admin' => 0,
            ],

        ]);
---
insert into `users` (`email`, `is_admin`, `name`, `password`) values ('admin@mail.ru', 1, 'admin', 'y$D/Mibid9v2yGlYMXXZl5k.zno7pwRifjnURvmvJnXPd5Zi210luli'), ('user@mail.ru', 0, 'user', 'y$PKqh265Tvh3TVupdOIF5zeXIunrA/ktRlo4giXg5F3NtgDOisL/1W')