app/Http/Controllers/AdminProductController.php

    public function show(Product $product)
    {
        $nameCategory =  function ($id)
        {
            $category = Category::where('id', $id)->first();
---
select * from `categories` where `id` = 1 limit 1

    public function update(AdminProductsRequest $request, Product $product)
    {
        $params = $request->all();
        unset($params['image']);
        if($request->has('image'))
        {
            Storage::delete($product->image);
            $path = $request->file('image')->store('product');
            $params['image'] = $path;
        }
        foreach (['new','hit','sale'] as $name)
        {
          if ( isset( $params[$name]) && $params[$name] !== 1){
              $params[$name] = 0;
          }else{
              $params[$name] = 1;
          }

        }


        $product->update($params);
---
update `products` set `count` = '5', `products`.`updated_at` = '2021-02-24 15:42:12' where `id` = 8