app/Http/Controllers/BasketController.php

select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 8 and `products`.`deleted_at` is null
---
    public function basketDel($product_id)
    {
        $order_id = session('order_idd');
        if( is_null($order_id) )
        {
            //используется редирект чтобы при обновлении стр. не добавлялось доп поле
            return redirect()->route('basket');
        }

        // беру из таблица Ордер поле заказа
        $order = Order::find($order_id);

        if($order->products->contains($product_id))
        {
            $pivotRow = $order->products()->where('product_id' , $product_id)->first()->pivot;