app/Http/Controllers/BasketController.php

update `orders` set `user_id` = 2, `orders`.`updated_at` = '2021-02-24 09:20:05' where `id` = 8
select * from `products` where (`id` = 1) and `products`.`deleted_at` is null limit 1
update `products` set `count` = 0, `products`.`updated_at` = '2021-02-24 09:20:05' where `id` = 1
---
    public function basketConfirm( ConfirmedOrderRequest $request)
    {
        $order_id = session('order_id');
        // Если никаких товаров не выбрано
        if (is_null($order_id))
        {
            return redirect()->route('home');
        }
        //Узнаю поле заявки на выбраные товары
        $order = Order::find($order_id);

        $success = $order->confirmedOrder($request->name, $request->phone);

        ($success) ? session()->flash('success', 'Заявка принята, в ближайшее время тебе позвонят') : '' ;


        if(Auth::check())
        {
            $order->user_id = Auth::id();
            $order->save();
        }

        foreach ($order->products as $product)
        {
            $productCount = $product->count;
            $orderCount = $product->pivot->count;
            $product = Product::where(['id'=>$product->id])->first();
            $product->count = $productCount - $orderCount;
            $product->update();

select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 8 and `product_id` = '3' and `products`.`deleted_at` is null limit 1
---
    public function basketAdd($product_id)
    {
        $productCount = Product::find($product_id)->count;
        $product = Product::find($product_id);

        //заказ по счету
        $order_id = session('order_id');
        //если сессия пустая
        if( is_null($order_id) )
        {
            $order = Order::create();
            session(['order_id' => $order->id]);
        }
        else
        {
            $order = Order::find($order_id);
        }
        if($order->products->contains($product_id))
        {
            $pivotRow = $order->products()->where('product_id' , $product_id)->first()->pivot;

insert into `order_product` (`created_at`, `order_id`, `product_id`, `updated_at`) values ('2021-02-24 09:04:53', 7, '17', '2021-02-24 09:04:53')
---

        }else
        {
            $order->products()->attach($product_id);

select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 4 and `product_id` = '1' and `products`.`deleted_at` is null limit 1
delete from `order_product` where `order_id` = 4 and `product_id` in ('1')
---
    public function basketDel($product_id)
    {
        $order_id = session('order_id');
        $order_id = session('order_id');
        if( is_null($order_id) )
        {
            //используется редирект чтобы при обновлении стр. не добавлялось доп поле
            return redirect()->route('basket');
        }

        $order = Order::find($order_id);

        if($order->products->contains($product_id))
        {
            $pivotRow = $order->products()->where('product_id' , $product_id)->first()->pivot;
            if($pivotRow->count < 2)
            {
                $order->products()->detach($product_id);