app/Http/Controllers/CategoryController.php

select * from `categories`
---
    public function categories()
    {
        $categories = Category::all();

select * from `categories` where `code` = 'subscription' limit 1
---
    public function category ($category_code, $product_code=null)
    {
        $category = Category::where('code', $category_code)->first();

select * from `categories` where `code` = 'mobile' limit 1
select * from `products` where `code` = 'htc_one_dual_slim' limit 1
---
    public function product ($category_code, $product_code=null)
    {
        $category = Category::where('code', $category_code)->first();
        $product = Product::withTrashed()->where('code',$product_code)->firstOrFail();