app/Http/Controllers/HomeController.php

        public function home (ProductFilterRequest $request)
        {

            $productsQuery = Product::where('show',1)->with('category');

            if($request->price_from)
            {
                $productsQuery->where('price', '>=', $request->price_from);
            }
            if($request->price_to)
            {
                $productsQuery->where('price', '<=', $request->price_to);
            }
            foreach (['new','hit','sale'] as $fieldCheck)
            {
                if($request->$fieldCheck)
                {
                    $productsQuery->$fieldCheck();
                }
            }
                                                            /*
                                                             * withPath описание данного хелпера или кто это я не нашел
                                                             * withPath думаю в следующей страницы погинации строит url
                                                             * getQueryString() |&page=3| показывает на какой странице пагинации
                                                            */
            $products = $productsQuery->paginate(9)->withPath('?'. $request->getQueryString());
---
select * from `categories` where `categories`.`id` in (1, 2, 3)
select * from `products` where `show` = 1 and `products`.`deleted_at` is null limit 9 offset 0
select count(*) as aggregate from `products` where `show` = 1 and `products`.`deleted_at` is null