app/Models/Order.php

    public function getFullPrice()
    {
        $sum = null;
        foreach ($this->products()->withTrashed()->get() as $product)
---
select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 8

    public function confirmedOrder($name, $phone)
    {
        if ($this->order == 0)
        {
            $this->name = $name;
            $this->phone = $phone;
            $this->status = 1;
            $this->save();
---
update `orders` set `status` = 1, `name` = '1111', `phone` = '777777', `orders`.`updated_at` = '2021-02-24 09:20:05' where `id` = 8