app/Models/SubscripeProduct.php

    public function scopeSubscribeWithStatusZeroInProduct($query, $productId){
        return $query->where('status',0)->where('product_id',$productId)->get();
---
select * from `subscripe_products` where `status` = 0 and `product_id` = 8